app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "bbbbb"], ["email", "bbbb@gmail.com"], ["password", "cccccc"], ["created_at", "2019-11-05 10:56:53.494000"], ["updated_at", "2019-11-05 10:56:53.494000"]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "karloapazamerma"], ["updated_at", "2019-11-19 13:44:01.402170"], ["id", 23]]