app/views/application/index.html.erb

<ul>
    <% User.all.each do |user| %>
---
SELECT "users".* FROM "users"